



Virtual_Student_Demographic_Config = {
    'age': {0: 'من 18 إلى 24 سنة', 1: 'من 25 إلى 31 سنة', 2: 'من 32 إلى 38 سنة', 3: 'أكبر من 39 سنة'},
    'gender': {0: 'أنثى', 1: 'ذكر', 2: 'غير ذلك'},
    'major': {0: 'العلوم الإنسانية والفنون', 1: 'العلوم الاجتماعية', 2: 'العلوم الطبيعية', 3: 'الهندسة والتكنولوجيا', 4: 'الأعمال والاقتصاد', 5: 'علوم الصحة والحياة'},
    'education': {0: 'الثانوية العامة', 1: 'طالب جامعي', 2: 'ماجستير', 3: 'دكتوراه'},
    'attitude': {1: 'متحمس جدا', 0: 'غير متحمس إطلاقا'},
    'exam': {1: 'حاصل على معدل مرتفع وعادة يجيب عن أسئلة الاختبار اللاحق إجابة صحيحة', 0: 'حاصل على معدل منخفض وعادة يخطئ في الاختبار اللاحق'},
    'focus': {1: 'شديد التركيز', 0: 'عادةً مشتت الذهن'},
    'curiosity': {1: 'فضولي لاستكشاف كل ما في المقرر', 0: 'لا يملك أي فضول نحو المقرر'},
    'interest': {1: 'مهتم جدا بالمقرر', 0: 'غير مهتم إطلاقا بالمقرر'},
    'priors': {1: 'يمتلك خلفية قوية ومعرفة سابقة في هذا المقرر', 0: 'لا يمتلك أي خلفية ولا أي معرفة سابقة في هذا المقرر'},
    'compliance': {1: 'منضبط ويواكب سرعة تدريس المعلمين', 0: 'غير راغب ويجد صعوبة في متابعة المعلمين'},
    'smartness': {1: 'ذكي ويفهم كل شيء بسرعة', 0: 'قليل الذكاء ويفهم ببطء'},
    'family': {1: 'الوالدان يمتلكان خلفية أكاديمية قوية', 0: 'الوالدان غير مهتمان بالتعليم على الإطلاق'},
}


Virtual_Student_Demographic_Config_Short = {
    'age': {0: '18-24', 1: '25-31', 2: '32-38', 3: '> 39'},
    'gender': {0: 'أنثى', 1: 'ذكر', 2: 'غير ذلك'},
    'major': {0: 'العلوم الإنسانية', 1: 'الاجتماعية', 2: 'الطبيعية', 3: 'التكنولوجيا', 4: 'الأعمال', 5: 'الصحة'},
    'education': {0: 'الثانوية العامة', 1: 'طالب جامعي', 2: 'ماجستير', 3: 'دكتوراه'},
    'attitude': {1: 'متحمس جدا', 0: 'غير متحمس إطلاقا'},
    'exam': {1: 'معدل عالي', 0: 'معدل منخفض'},
    'focus': {1: 'مركز', 0: 'مشتت'},
    'curiosity': {1: 'فضولي', 0: 'ليس فضولي'},
    'interest': {1: 'مهتم', 0: 'غير مهتم'},
    'priors': {1: 'خلفية قوية', 0: 'لا يمتلك أي خلفية'},
    'compliance': {1: 'منضبط', 0: 'يعاني'},
    'smartness': {1: 'ذكي', 0: 'ليس ذكي'},
    'family': {1: 'أكاديمية قوية', 0: 'غير مهتمان بالتعليم'},
}